---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrentPhaseC
source: html/55a84d00-8cdf-803d-343c-25d327fd37d0.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.TrueCurrentPhaseC Property

The TrueCurrentPhaseC value of the Electrical System.

## Syntax (C#)
```csharp
public double TrueCurrentPhaseC { get; }
```

## Remarks
This property is used to retrieve the TrueCurrentPhaseC value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!